from dao.models.movie import Movie
from dao.models.director import Director
from dao.models.genre import Genre


def create_data(app, db):
    with app.app_context():
        db.drop_all()
        db.create_all()

        data = {
            "movies": [
                {
                    "title": "Криминальное чтиво",
                    "description": "Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками и решением проблем с должниками криминального босса Марселласа Уоллеса.",
                    "trailer": "https://www.kinopoisk.ru/film/342/",
                    "year": 1994,
                    "rating": 8.6,
                    "genre_id": 15,
                    "director_id": 1,
                    "pk": 1
                },
                {
                    "title": "Джентльмены",
                    "description": "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.",
                    "trailer": "https://www.kinopoisk.ru/film/1143242/",
                    "year": 2019,
                    "rating": 8.5,
                    "genre_id": 15,
                    "director_id": 2,
                    "pk": 2
                },
                {
                    "title": "Гнев человеческий",
                    "description": "Грузовики лос-анджелесской инкассаторской компании Fortico Security часто подвергаются нападениям, и во время очередного ограбления погибают оба охранника. Через некоторое время в компанию устраивается крепкий немногословный британец Патрик Хилл. Он получает от босса прозвище Эйч и, впритык к необходимому минимуму пройдя тесты по фитнесу, стрельбе и вождению, отправляется на первое задание. Вскоре и его грузовик пытаются ограбить вооруженные налётчики, но Эйч в одиночку расправляется с целой бандой и становится героем. Кажется, слава и уважение коллег его совершенно не интересуют, ведь он преследует свои цели.",
                    "trailer": "https://www.kinopoisk.ru/film/1318972/",
                    "year": 2021,
                    "rating": 7.6,
                    "genre_id": 12,
                    "director_id": 2,
                    "pk": 3
                },
                {
                    "title": "Волк с Уолл-стрит",
                    "description": "1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды. Он знакомится с соседом по дому Донни, торговцем, который сразу находит общий язык с Джорданом и решает открыть с ним собственную фирму. В качестве сотрудников они нанимают нескольких друзей Белфорта, его отца Макса и называют компанию «Стрэттон Оукмонт». В свободное от работы время Джордан прожигает жизнь: лавирует от одной вечеринки к другой, вступает в сексуальные отношения с проститутками, употребляет множество наркотических препаратов, в том числе кокаин и кваалюд. Однажды наступает момент, когда быстрым обогащением Белфорта начинает интересоваться агент ФБР...",
                    "trailer": "https://www.kinopoisk.ru/film/462682/",
                    "year": 2013,
                    "rating": 8.0,
                    "genre_id": 4,
                    "director_id": 3,
                    "pk": 4
                },
                {
                    "title": "Начало",
                    "description": "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил.",
                    "trailer": "https://www.kinopoisk.ru/film/447301/",
                    "year": 2010,
                    "rating": 8.7,
                    "genre_id": 7,
                    "director_id": 4,
                    "pk": 5
                },
                {
                    "title": "Оно 2",
                    "description": "Проходит 27 лет после первой встречи ребят с демоническим Пеннивайзом. Они выросли, покинули родной городок и практически забыли о тех страшных событиях, но неожиданно в их взрослые проблемы вторгается телефонный звонок. Майк никогда не покидал Дерри и всё это время собирал информацию о жутком клоуне и ждал. Когда в городе начали происходить новые убийства, Майк просит старых друзей вновь собраться вместе и разобраться со злом города Дерри раз и навсегда.",
                    "trailer": "https://www.kinopoisk.ru/film/686898/",
                    "year": 2019,
                    "rating": 6.5,
                    "genre_id": 11,
                    "director_id": 5,
                    "pk": 6
                }],
            "directors": [
                {"name": "Квентин Тарантино", "pk": 1},
                {"name": "Гай Ричи", "pk": 2},
                {"name": "Мартин Скорсезе", "pk": 3},
                {"name": "Кристофер Нолан", "pk": 4},
                {"name": "Стивен Кинг", "pk": 5}

            ],
            "genres": [
                {"name": "Комедия", "pk": 1}, {"name": "Семейный", "pk": 2}, {"name": "Фэнтези", "pk": 3},
                {"name": "Драма", "pk": 4}, {"name": "Приключения", "pk": 5}, {"name": "Триллер", "pk": 6},
                {"name": "Фантастика", "pk": 7}, {"name": "Аниме", "pk": 8}, {"name": "Документальное", "pk": 9},
                {"name": "Короткометражка", "pk": 10}, {"name": "Ужасы", "pk": 11}, {"name": "Боевик", "pk": 12},
                {"name": "Мелодрама", "pk": 13}, {"name": "Детектив", "pk": 14}, {"name": "Криминал", "pk": 15},
                {"name": "Мультфильм", "pk": 16}, {"name": "Вестерн", "pk": 17}, {"name": "Мюзикл", "pk": 18}]
        }

        for movie in data["movies"]:
            m = Movie(
                id=movie["pk"],
                title=movie["title"],
                description=movie["description"],
                trailer=movie["trailer"],
                year=movie["year"],
                rating=movie["rating"],
                genre_id=movie["genre_id"],
                director_id=movie["director_id"]
            )

            db.session.add(m)
            db.session.commit()
            db.session.close()

        for director in data["directors"]:
            d = Director(
                id=director["pk"],
                name=director["name"]
            )
            db.session.add(d)
            db.session.commit()
            db.session.close()

        for genre in data["genres"]:
            g = Genre(
                id=genre["pk"],
                name=genre["name"]
            )
            db.session.add(g)
            db.session.commit()
            db.session.close()
